#pragma once

// Rogue Company (0.6X) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "RoCo_Basic.hpp"
#include "RoCo_SlateCore_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct UIFontPalette.UIFontPalette
// 0x0230
struct FUIFontPalette
{
	struct FSlateFontInfo                              GeneralHeading_17_D2D2858D46D790E57D7D8A9140F3A45C;       // 0x0000(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              TooltipHeading_18_4EA193C444FE7A4F73827A86213800F5;       // 0x0050(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              SubScreenHeading_29_CC0C81724643CD2C73AFF383D8355F77;     // 0x00A0(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              Subtitle_30_652CCC224E670DDF122B228933B5A5F2;             // 0x00F0(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              BoldSubtitle_31_82D86BB848ED28066E5B5AA3D4E4DED0;         // 0x0140(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              GeneralBodyCopy_26_84EC6719490FA1867F42869A5E146E06;      // 0x0190(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FSlateFontInfo                              FictionBodyCopy_28_221EDF9F4EE5F5DA0B9A18819EFE44C2;      // 0x01E0(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
