#pragma once

// Rogue Company (0.59) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "RoCo_KillstreakUINew_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class KillstreakUINew.GuidedMenuCalloutData
// 0x0028 (0x0050 - 0x0028)
class UGuidedMenuCalloutData : public UObject
{
public:
	struct FText                                       HeaderText;                                               // 0x0028(0x0018) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NativeAccessSpecifierPublic)
	TArray<struct FGuidedCalloutCardData>              CalloutCards;                                             // 0x0040(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.GuidedMenuCalloutData");
		return ptr;
	}

};


// Class KillstreakUINew.GuidedMenuCalloutsViewRedirector
// 0x0010 (0x0038 - 0x0028)
class UGuidedMenuCalloutsViewRedirector : public UPUMG_ViewRedirecter
{
public:
	class UDataTable*                                  GuidedCalloutsTable;                                      // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.GuidedMenuCalloutsViewRedirector");
		return ptr;
	}


	void SetNPEGuidedCalloutSeen(EConfigPropertyGuidedCalloutScenes GuidedCalloutScene);
	bool HasSeenNPEGuidedCallout(EConfigPropertyGuidedCalloutScenes GuidedCalloutScene);
};


// Class KillstreakUINew.KSWidget
// 0x0040 (0x04E0 - 0x04A0)
class UKSWidget : public UPUMG_Widget
{
public:
	bool                                               bIsUIOnlyWidget;                                          // 0x04A0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               bIsExclusiveMenuWidget;                                   // 0x04A1(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x2];                                       // 0x04A2(0x0002) MISSED OFFSET
	int                                                AmbientSoundRtpc;                                         // 0x04A4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UTickAnimationManager*                       TickAnimations;                                           // 0x04A8(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	struct FScriptDelegate                             ViewportEvent;                                            // 0x04B0(0x0014) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_NoDestructor, CPF_NativeAccessSpecifierPrivate)
	bool                                               bSubstituteKillCamWorld;                                  // 0x04C0(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               bSubstituteKillCamOwningPlayer;                           // 0x04C1(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               bWantsKillCamCallbacks;                                   // 0x04C2(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x1D];                                      // 0x04C3(0x001D) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSWidget");
		return ptr;
	}


	void UnbindFromViewportSizeChange();
	void TriggerGlobalInvalidate();
	void StopTickAnimation(const struct FName& AnimName);
	void SkipToEndTickAnimation(const struct FName& AnimName);
	void SetAllAnimationsPlaybackSpeed(float PlaybackSpeed);
	void ResumeTickAnimation(const struct FName& AnimName);
	void RemoveTickAnimation(const struct FName& AnimName);
	void PlayTickAnimation(const struct FName& AnimName);
	void PauseTickAnimation(const struct FName& AnimName);
	bool IsInKillCamPlayback();
	void InitializeTickAnimations();
	bool GetTickAnimationInfo(const struct FName& AnimName, struct FTickAnimationParams* OutAnimParams);
	class APlayerController* GetNormalOwningPlayer();
	class APlayerController* GetKillCamSpectatorController();
	class APlayerController* GetActivePlayerController();
	void BlueprintPrepareKillCamPlayback();
	void BlueprintFinishKillCamPlayback();
	void BindToViewportSizeChange(const struct FScriptDelegate& InViewportEvent);
	void AddTickAnimation(const struct FName& AnimName, float Duration, const struct FScriptDelegate& UpdateEvent, const struct FScriptDelegate& FinishedEvent);
};


// Class KillstreakUINew.KSAccoladeQueueWidget
// 0x0050 (0x0530 - 0x04E0)
class UKSAccoladeQueueWidget : public UKSWidget
{
public:
	bool                                               IsBusy;                                                   // 0x04E0(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04E1(0x0003) MISSED OFFSET
	int                                                NumInQueue;                                               // 0x04E4(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    OnAccoladeReceived;                                       // 0x04E8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    OnAccoladeUpdateMultiplier;                               // 0x04F8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0508(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAccoladeQueueWidget");
		return ptr;
	}


	void Queue(TArray<struct FAccoladeEventEntry> Accolades);
	void OnAccoladeRemovedFromScreen(const struct FAccoladeDisplayInfo& AccoladeRemoved);
	bool GetNext(struct FAccoladeDisplayInfo* Accolade);
	void ClearAccoladeQueue();
};


// Class KillstreakUINew.KSAcquisitionModal
// 0x0058 (0x0538 - 0x04E0)
class UKSAcquisitionModal : public UKSWidget
{
public:
	class UDataTable*                                  HeaderOverridesTable;                                     // 0x04E0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TMap<int, struct FText>                            HeaderOverridesFromJson;                                  // 0x04E8(0x0050) (CPF_Transient, CPF_Protected, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAcquisitionModal");
		return ptr;
	}


	struct FText GetHeaderText(class UKSAcquisition* Acquisitition);
	class UKSAcquisitionManager* GetAcquisitionManager();
};


// Class KillstreakUINew.KSActiveBonusesWidget
// 0x0008 (0x04E8 - 0x04E0)
class UKSActiveBonusesWidget : public UKSWidget
{
public:
	class UDataTable*                                  EventLookupTable;                                         // 0x04E0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSActiveBonusesWidget");
		return ptr;
	}


	void GetBonusAppliedToLastMatch(TArray<struct FKSLimitedTimeEventMetadataRow>* ActiveEvents);
};


// Class KillstreakUINew.KSPawnWidget
// 0x0020 (0x0500 - 0x04E0)
class UKSPawnWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x04E0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSPawnWidget");
		return ptr;
	}


	void SetPlayerStateUIRelevanceChanged();
	void SetPawn(class AKSCharacter* NewPawn);
	void PreClearPlayerState();
	void PreClearPawn();
	void PostSetPlayerState();
	void PostSetPawn();
	void OnBoundPlayerStateDestroyed(class AActor* DestroyedActor);
	void OnBoundPawnDestroyed(class AActor* DestroyedActor);
	class AKSPlayerState* GetPlayerState();
	class AKSCharacterBase* GetPawnBase();
	class AKSCharacter* GetPawn();
};


// Class KillstreakUINew.KSPawnInventoryWidget
// 0x0070 (0x0570 - 0x0500)
class UKSPawnInventoryWidget : public UKSPawnWidget
{
public:
	TMap<struct FKSEquipmentId, class UKSWeaponComponentWidget*> EquipmentWidgets;                                         // 0x0500(0x0050) (CPF_ExportObject, CPF_ContainsInstancedReference, CPF_NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0550(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSPawnInventoryWidget");
		return ptr;
	}


	bool RemoveWidgetFor(class UKSWeaponComponent* InWeaponComponent);
	class UKSWeaponComponentWidget* GetWidgetForWeaponComponent(class UKSWeaponComponent* InWeaponComponent);
	void EquipmentRemoved(class UKSWeaponComponent* RemovedEquipment);
	void EquipmentEndActive(class UKSWeaponComponent* InactiveEquipment);
	void EquipmentBecomeActive(class UKSWeaponComponent* ActiveEquipment);
	void EquipmentAdded(class UKSWeaponComponent* AddedEquipment);
	class UKSWeaponComponentWidget* CreateWeaponComponentWidgetFor(class UObject* WorldContextObject, class UKSWeaponComponent* InWeaponComponent, class UClass* WidgetClass, class APlayerController* OwningPlayer);
};


// Class KillstreakUINew.KSActiveWeaponComponentWidget
// 0x0038 (0x05A8 - 0x0570)
class UKSActiveWeaponComponentWidget : public UKSPawnInventoryWidget
{
public:
	int                                                ActiveWeaponSlot;                                         // 0x0570(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0574(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       EquipPointsToIgnore;                                      // 0x0578(0x0020) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	bool                                               bDelayClearUntilNextTick;                                 // 0x0598(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0599(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UKSWeaponComponent>           WeakActiveWeaponComponentPtr;                             // 0x059C(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData02[0x4];                                       // 0x05A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSActiveWeaponComponentWidget");
		return ptr;
	}


	void PreClearActiveWeaponComponent();
	void PostSetActiveWeaponComponent();
	class UKSWeaponComponent* GetActiveWeaponComponent();
};


// Class KillstreakUINew.KSActivity_ViewRedirector
// 0x0010 (0x0038 - 0x0028)
class UKSActivity_ViewRedirector : public UPUMG_ViewRedirecter
{
public:
	TArray<TSoftObjectPtr<class UKSActivity>>          ActivitiesToCheck;                                        // 0x0028(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_Protected, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSActivity_ViewRedirector");
		return ptr;
	}


	class UKSActivityManagerBase* GetRelevantActivityManager(class UKSGameInstance* GameInstance);
};


// Class KillstreakUINew.KSAimAssistDebugWidget
// 0x0008 (0x0240 - 0x0238)
class UKSAimAssistDebugWidget : public UUserWidget
{
public:
	bool                                               bDrawAimAssistBoundary;                                   // 0x0238(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bDrawHeadAimCorrectionBoundary;                           // 0x0239(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bDrawMagnetismDebug;                                      // 0x023A(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bDrawTargetInfo;                                          // 0x023B(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x4];                                       // 0x023C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAimAssistDebugWidget");
		return ptr;
	}


	class AKSPlayerController* GetOwningKSPlayer();
	class UKSAimAssistComponent* GetAimAssistComponent();
};


// Class KillstreakUINew.KSMapIconWidgetBase
// 0x00E0 (0x0318 - 0x0238)
class UKSMapIconWidgetBase : public UUserWidget
{
public:
	bool                                               bDoesIconRotate;                                          // 0x0238(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0239(0x0003) MISSED OFFSET
	float                                              MarkerAnchorHeight;                                       // 0x023C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              HeightThreshold;                                          // 0x0240(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0244(0x0004) MISSED OFFSET
	float                                              CachedRawMetersAway;                                      // 0x0248(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	int                                                UniqueId;                                                 // 0x024C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AKSPlayerState>               CreatingPlayer;                                           // 0x0250(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	EDisplayType                                       ParentMapDisplayType;                                     // 0x0258(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0259(0x0003) MISSED OFFSET
	TWeakObjectPtr<class AActor>                       AssociatedActor;                                          // 0x025C(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                      AssociatedObject;                                         // 0x0264(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FVector                                     DefaultLocation;                                          // 0x026C(0x000C) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              Lifespan;                                                 // 0x0278(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UKSMapWidgetBase>             ParentMapWidget;                                          // 0x027C(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FVector2D                                   ScreenMargins;                                            // 0x0284(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              CenterPercentageWidth;                                    // 0x028C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              CenterPercentageHeight;                                   // 0x0290(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              OpacityWhenAiming;                                        // 0x0294(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               DoesFadeOutWhenAiming;                                    // 0x0298(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0299(0x0003) MISSED OFFSET
	float                                              AimTransitionOpacity;                                     // 0x029C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FVector                                     IconOffset;                                               // 0x02A0(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData04[0x18];                                      // 0x02AC(0x0018) MISSED OFFSET
	float                                              HoverDelaySeconds;                                        // 0x02C4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData05[0x18];                                      // 0x02C8(0x0018) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnMapIconWidgetReady;                                     // 0x02E0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnMapIconWidgetRemove;                                    // 0x02F0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	bool                                               bIsWidgetPool;                                            // 0x0300(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData06[0x7];                                       // 0x0301(0x0007) MISSED OFFSET
	struct FString                                     WidgetPoolName;                                           // 0x0308(0x0010) (CPF_ZeroConstructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSMapIconWidgetBase");
		return ptr;
	}


	void UpdateScreenRegion();
	void UpdateOpacityWhenAiming();
	void UpdateMetersAway(int Meters);
	void UpdateMeetsHeightThreshold(bool bHeight, bool bDepth);
	ESlateVisibility Update();
	bool ShouldUpdateOpacityWhenAiming();
	bool ShouldUpdateHover();
	bool ShouldUpdate();
	void SetScreenRegion(EIconMarkerScreenRegion ScreenRegion);
	void SetLifeSpan(float InLifespan);
	void SetDisplayInfo(int InUniqueId, class AKSPlayerState* InCreatingPlayer, EDisplayType InParentMapDisplayType, class AActor* InAssociatedActor, class UObject* InAssociatedObject, const struct FVector& InDefaultLocation, float InLifespan);
	void SetArrowAngle(float Angle);
	void ResetDisplayInfo();
	void OnUnhoverTimerComplete();
	void OnHoverTimerComplete();
	void OnHoverStateChanged(EIconHoverState NewHoverState);
	void OnAssociatedActorDestroyed(class AActor* Actor);
	void OnAimStateChanged(EKSCharacterAimMode NewAimState, float NewAimTransitionOffset);
	void IsScreenRegion(bool* InsideCenter, bool* InsideMargins);
	bool IsInCenteredScreenRect(float PositionX, float PositionY, float XMargin, float YMargin);
	bool IsHovering();
	void HandleMapIconWidgetHide();
	float GetWorldYaw();
	struct FVector GetWorldPosition();
	EIconHoverState GetHoverState();
	float GetEdgeArrowAngleBase(float Angle);
	float GetDistanceToIcon();
	void GetArrowPosition(bool IsIconVisible, float Angle, struct FVector2D* ArrowPosition);
};


// Class KillstreakUINew.KSAllyMarkerWidget
// 0x0058 (0x0370 - 0x0318)
class UKSAllyMarkerWidget : public UKSMapIconWidgetBase
{
public:
	class UWidget*                                     ArrowWidget;                                              // 0x0318(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UWidget*                                     NameOrStatusWidget;                                       // 0x0320(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UWidget*                                     DownedSectionWidget;                                      // 0x0328(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnGameModeModActivationChanged;                           // 0x0330(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	class UDataTable*                                  ContextualPingTypesDT;                                    // 0x0340(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UDataTable*                                  ContextualPingMessagesDT;                                 // 0x0348(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0350(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAllyMarkerWidget");
		return ptr;
	}


	void View_SetSelfPingIcon(EPingType PingType, EPingMessage PingMessage);
	void View_SetRevivePercent(float PercentValue);
	void View_SetNameText(const struct FText& NameText);
	void View_SetMode(EAllyMarkerState AllyMarkerState, bool HasObjective, bool HasSelfPing);
	void View_SetJob(class UKSJobItem* Job);
	void View_SetHealthPercent(float PercentValue);
	void View_AcknowledgeSelfPing(class AKSPlayerState* AcknowledingPlayer);
	void SetPlayerName();
	void SetMarkerPlayerState(class AKSPlayerState* pPlayerState);
	bool IsOwningPlayer();
	void HandleUIRelevantChanged(class AKSPlayerState* InPlayerState);
	void HandleRemoveSelfPing(class AKSPlayerState* PingingPlayer);
	void HandlePlayerModActivated(class UKSPlayerMod_Activated* ActivatedMod, bool Active);
	void HandlePlayerDown(const struct FCombatEventInfo& CombatEventInfo, int ExpBonus);
	void HandlePlayerDeath(const struct FCombatEventInfo& DeathInfo);
	void HandleOnJobChanged();
	void HandleObjectiveStateChanged(const TScriptInterface<class UKSObjective>& GameObjective);
	void HandleChangeSelfPing(class AKSPlayerState* PingingPlayer, class AKSPlayerState* AcknowledgingPlayer);
	void HandleBombStateChanged(const struct FKSNeutralBombState& BombState);
	void HandleAddSelfPing(class AKSPlayerState* PingingPlayer, EPingType PingType, EPingMessage PingMessage);
	bool GetPingIconByType(EPingType PingType, TSoftObjectPtr<class UTexture2D>* PingIcon);
	bool GetPingIconByMessage(EPingMessage PingMessage, TSoftObjectPtr<class UTexture2D>* PingIcon);
	bool GetPingColorByType(EPingType PingType, struct FLinearColor* PingColor);
	struct FVector2D GetArrowPositionFromAngleBlueprint(float Angle);
	bool FindRowByType(EPingType PingType, struct FContextualPingTypesRow* ContextualPingTypesRow);
	bool FindRowByMessage(EPingMessage PingMessage, struct FContextualPingMessagesRow* ContextualPingMessagesRow);
	void ChangeOwnerContentVisibility(bool bVisible);
};


// Class KillstreakUINew.KSAlphaDisclaimer
// 0x0000 (0x04E0 - 0x04E0)
class UKSAlphaDisclaimer : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAlphaDisclaimer");
		return ptr;
	}


	static bool LoadAlphaDisclaimerText(struct FString* SaveText);
};


// Class KillstreakUINew.KSWeaponWidget
// 0x0008 (0x04E8 - 0x04E0)
class UKSWeaponWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04E0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSWeaponWidget");
		return ptr;
	}


	void SetOwningWeapon(class AKSWeapon* InWeapon);
	void PreClearWeapon();
	void PostSetWeapon();
	void OtherWeaponUpdate();
	void OnOwningWeaponDestroyed(class AActor* DestroyedWeapon);
	class AKSWeapon* GetOwningWeapon();
};


// Class KillstreakUINew.KSAmmoWidget
// 0x0020 (0x0508 - 0x04E8)
class UKSAmmoWidget : public UKSWeaponWidget
{
public:
	int                                                CachedAmmoInClip;                                         // 0x04E8(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	int                                                CachedClipSize;                                           // 0x04EC(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	int                                                CachedInReserve;                                          // 0x04F0(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               CachedIsReloading;                                        // 0x04F4(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x13];                                      // 0x04F5(0x0013) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAmmoWidget");
		return ptr;
	}


	void StopReloading();
	void StartReloading();
	void OnAmmoChanged(int OldInClip, int OldClipSize, int OldReserve, int NewInClip, int NewClipSize, int NewReserve);
};


// Class KillstreakUINew.KSAnnouncementQueuedMessageWidget
// 0x0048 (0x0528 - 0x04E0)
class UKSAnnouncementQueuedMessageWidget : public UKSWidget
{
public:
	struct FScriptMulticastDelegate                    OnEndDisplay;                                             // 0x04E0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_BlueprintCallable, CPF_NativeAccessSpecifierPublic)
	struct FAnnouncementData                           AnnouncementData;                                         // 0x04F0(0x0038) (CPF_Edit, CPF_BlueprintVisible, CPF_Protected, CPF_ExposeOnSpawn, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAnnouncementQueuedMessageWidget");
		return ptr;
	}


	void DisplayAnnouncement();
};


// Class KillstreakUINew.KSAnnouncementQueueWidget
// 0x0030 (0x0510 - 0x04E0)
class UKSAnnouncementQueueWidget : public UKSWidget
{
public:
	bool                                               IsBusy;                                                   // 0x04E0(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReadyForNextAnnouncement;                               // 0x04E8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x18];                                      // 0x04F8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSAnnouncementQueueWidget");
		return ptr;
	}


	void Queue(const struct FAnnouncementData& Announcement);
	bool GetNext(struct FAnnouncementData* Announcement);
	void ClearAnnoucementQueue();
};


// Class KillstreakUINew.KSBoostInventoryWidget
// 0x0000 (0x04E0 - 0x04E0)
class UKSBoostInventoryWidget : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSBoostInventoryWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSBoostInventoryItemWidget
// 0x0010 (0x04F0 - 0x04E0)
class UKSBoostInventoryItemWidget : public UKSWidget
{
public:
	struct FAccountConsumableDetails                   CurrentItemDetails;                                       // 0x04E0(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NoDestructor, CPF_Protected, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSBoostInventoryItemWidget");
		return ptr;
	}


	void View_SetFromItem(const struct FAccountConsumableDetails& ItemDetails);
	void ShowBoostPopup();
	void SetItem(const struct FAccountConsumableDetails& ItemDetails);
	void PlayBoostConfirmationSound();
	void OnActivateBoostConfirm();
	void OnActivateBoostCancel();
};


// Class KillstreakUINew.KSChallengeEntryCardBase
// 0x0008 (0x04E8 - 0x04E0)
class UKSChallengeEntryCardBase : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04E0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSChallengeEntryCardBase");
		return ptr;
	}


	void SetChallengeData(class UKSActivityInstance* ActivityInstance);
	void DisplayRewardItems(TArray<struct FTierRewardItemData> RewardItems);
	void ApplyRerollAvailable(bool CanReroll);
	void ApplyLayoutType(EChallengeEntryCardState CardState);
	void ApplyChallengeProgress(int Progress, int ProgressTotal);
	void ApplyChallengeDescription(const struct FText& DescText);
};


// Class KillstreakUINew.KSChatDataFactory
// 0x0000 (0x0118 - 0x0118)
class UKSChatDataFactory : public UPUMG_ChatDataFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSChatDataFactory");
		return ptr;
	}

};


// Class KillstreakUINew.KSComponentReticleWidgetBase
// 0x0020 (0x05C8 - 0x05A8)
class UKSComponentReticleWidgetBase : public UKSActiveWeaponComponentWidget
{
public:
	float                                              ShrinkAnimationTime;                                      // 0x05A8(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              BlockedShotIconMaxScale;                                  // 0x05AC(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              BlockedShotIconMinScale;                                  // 0x05B0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              BlockedShotMinScaleSqDist;                                // 0x05B4(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bGrenadeCooking;                                          // 0x05B8(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bInADS;                                                   // 0x05B9(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bCachedBlockIconVisible;                                  // 0x05BA(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData00[0x1];                                       // 0x05BB(0x0001) MISSED OFFSET
	float                                              CachedWeaponAccuracy;                                     // 0x05BC(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	float                                              CachedReticleOffset;                                      // 0x05C0(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData01[0x4];                                       // 0x05C4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSComponentReticleWidgetBase");
		return ptr;
	}


	void ViewedPawnInstigatedDamageNotify(const struct FCombatEventInfo& DamageInfo);
	void UpdateReticleOffset(float OffsetFromCenterScreen);
	void UpdateBlockedShotIcon(bool IconVisible, const struct FVector2D& Translation, const struct FVector2D& IconScale);
	void CalculateReticleOffset(float DeltaTime);
	void CalculateBlockedShotIcon();
};


// Class KillstreakUINew.ContextActionData
// 0x0060 (0x0088 - 0x0028)
class UContextActionData : public UObject
{
public:
	struct FName                                       RowName;                                                  // 0x0028(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FContextAction                              RowData;                                                  // 0x0030(0x0048) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NativeAccessSpecifierPublic)
	struct FScriptDelegate                             OnContextAction;                                          // 0x0078(0x0014) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.ContextActionData");
		return ptr;
	}


	void TriggerContextAction();
};


// Class KillstreakUINew.KSContextBarWidget
// 0x0078 (0x0558 - 0x04E0)
class UKSContextBarWidget : public UKSWidget
{
public:
	class UDataTable*                                  ContextActionDT;                                          // 0x04E0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TMap<struct FName, struct FRouteContextInfo>       RouteContextInfoMap;                                      // 0x04E8(0x0050) (CPF_Protected, CPF_NativeAccessSpecifierProtected)
	struct FName                                       ActiveRoute;                                              // 0x0538(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TArray<struct FName>                               OverrideRouteStack;                                       // 0x0540(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FName                                       OverrideRoute;                                            // 0x0550(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSContextBarWidget");
		return ptr;
	}


	void UpdateContextActions(TArray<class UContextActionData*> ContextActions, const struct FName& CurrentRoute);
	void SetPrompts(const struct FName& Route, TArray<struct FName> ContextNames);
	void SetPromptAction(const struct FName& Route, const struct FName& ContextName, const struct FScriptDelegate& EventCallback);
	void SetPrompt(const struct FName& Route, const struct FName& ContextName);
	void SetOverrideRoute(const struct FName& Route);
	void SetActiveRoute(const struct FName& Route);
	void RefreshContextBar();
	void PushOverrideRoute(const struct FName& Route);
	struct FName PopOverrideRoute();
	void OverrideKeyButtons();
	struct FName GetCurrentContextRoute();
	void ClearPromptByKey(const struct FName& Route, const struct FKey& Key);
	void ClearPrompt(const struct FName& Route, const struct FName& ContextName);
	void ClearOverrideRouteStack();
	void ClearOverrideRoute();
	void ClearAllPrompts(const struct FName& Route);
};


// Class KillstreakUINew.KSContextMenu
// 0x0050 (0x0530 - 0x04E0)
class UKSContextMenu : public UKSWidget
{
public:
	struct FScriptMulticastDelegate                    OnContextOptionsUpdated;                                  // 0x04E0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    OnReportPlayer;                                           // 0x04F0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	EPlayerContextMenuContext                          MenuContext;                                              // 0x0500(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bAllowReportPlayer;                                       // 0x0501(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0502(0x0006) MISSED OFFSET
	class UKSPlayerInfo*                               CurrentPlayerInfo;                                        // 0x0508(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TArray<class UKSContextMenuButton*>                ContextMenuButtons;                                       // 0x0510(0x0010) (CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_ContainsInstancedReference, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	EViewSide                                          MenuViewSide;                                             // 0x0520(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0521(0x0003) MISSED OFFSET
	int                                                CachedQueuedOrInMatch;                                    // 0x0524(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bCachedReportedPlayer;                                    // 0x0528(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0529(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSContextMenu");
		return ptr;
	}


	void SetOptionsVisibility();
	struct FVector2D SetMenuPosition(class UKSWidget* WidgetToMove, const struct FMargin& WidgetPadding, EViewSide side, float menuWidth, float menuHeight);
	void SetCurrentPlayerInfo(class UKSPlayerInfo* playerinfo);
	void RemoveContextMenuButton(class UKSContextMenuButton* ContextButton);
	bool OnOptionSelected(EPlayerContextOptions ContextOption);
	void HandleOnQueueStatusChange(EPUMG_MatchStatus QueueStatus);
	class UPUMG_QueueDataFactory* GetQueueDataFactory();
	class UKSPlayerDataFactory* GetPlayerDataFactory();
	class UPUMG_PartyDataFactory* GetPartyDataFactory();
	class UKSFriendDataFactory* GetFriendDataFactory();
	class UKSContextMenuButton* GetContextButtonByEnum(EPlayerContextOptions ContextOption);
	void ClearAllContextMenuButton();
	void AddContextMenuButton(class UKSContextMenuButton* ContextButton);
};


// Class KillstreakUINew.KSContextMenuButton
// 0x0008 (0x04E8 - 0x04E0)
class UKSContextMenuButton : public UKSWidget
{
public:
	EPlayerContextOptions                              ContextOption;                                            // 0x04E0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_ExposeOnSpawn, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSContextMenuButton");
		return ptr;
	}


	void SetContextOption(EPlayerContextOptions Context);
	void HandleVisibility(bool isVisibility);
	void HandleActive(bool IsActive);
	EPlayerContextOptions GetContextOption();
};


// Class KillstreakUINew.KSContextualPingMarkerWidget
// 0x0088 (0x03A0 - 0x0318)
class UKSContextualPingMarkerWidget : public UKSMapIconWidgetBase
{
public:
	struct FScriptMulticastDelegate                    OnPingRemovedCalled;                                      // 0x0318(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPingChangedCalled;                                      // 0x0328(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FPingInfo                                   CurrentPingInfo;                                          // 0x0338(0x0050) (CPF_BlueprintVisible, CPF_NativeAccessSpecifierPublic)
	class UKSPingManager*                              PingManager;                                              // 0x0388(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UDataTable*                                  ContextualPingTypesDT;                                    // 0x0390(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UDataTable*                                  ContextualPingMessagesDT;                                 // 0x0398(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSContextualPingMarkerWidget");
		return ptr;
	}


	void SetupPingOnReady();
	void SetPingInfo(const struct FPingInfo& PingInfoVal);
	void OnPingUnhovered(int PingId, class AKSPlayerState* PingingPlayer);
	void OnPingHovered(int PingId, class AKSPlayerState* PingingPlayer);
	void OnInitializePing();
	bool IsInvisiblePingType(EPingType PingType);
	void HandleOnContextualPingRemoved(int PingId, class AKSPlayerState* PingingPlayer);
	void HandleOnContextualPingChanged(int PingId, class AKSPlayerState* PingingPlayer, class AKSPlayerState* AcknowledgingPlayer);
	float GetPingLifeSpan(EPingType PingType);
	bool GetPingIconByType(EPingType PingType, TSoftObjectPtr<class UTexture2D>* PingIcon);
	bool GetPingIconByMessage(EPingMessage PingMessage, TSoftObjectPtr<class UTexture2D>* PingIcon);
	bool GetPingColorByType(EPingType PingType, struct FLinearColor* PingColor);
	bool FindRowByType(EPingType PingType, struct FContextualPingTypesRow* ContextualPingTypesRow);
	bool FindRowByMessage(EPingMessage PingMessage, struct FContextualPingMessagesRow* ContextualPingMessagesRow);
};


// Class KillstreakUINew.KSCosmeticItemSelectorWidget
// 0x0000 (0x04E0 - 0x04E0)
class UKSCosmeticItemSelectorWidget : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSCosmeticItemSelectorWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSCustomizationSelection
// 0x0030 (0x0510 - 0x04E0)
class UKSCustomizationSelection : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04E0(0x0008) MISSED OFFSET
	TArray<struct FRogueCustomizationRelatedInfo>      RogueCustomizationRelatedInfos;                           // 0x04E8(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_ContainsInstancedReference, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TArray<EMercCosmeticSlot>                          ActiveCosmeticSlots;                                      // 0x04F8(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	int                                                TabIndex;                                                 // 0x0508(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x4];                                       // 0x050C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSCustomizationSelection");
		return ptr;
	}


	void TabRight();
	void TabLeft();
	void SetWingSuitAsset(class UKSWeaponAsset* WingSuit);
	void PurchaseAndEquip(EMercCosmeticSlot SlotType, int SlotPosition, class UKSJobItem* JobItem, class UPUMG_StoreItem* StoreItem);
	bool IsItemOwned(class UPlatformInventoryItem* Item);
	void GetWingSuitItems(TArray<TSoftObjectPtr<class UKSItem>>* OwnedItems, TArray<class UPUMG_StoreItem*>* StoreItems);
	class UKSWeaponAsset* GetWingSuitAsset();
	void GetWeaponSlotItems(EWeaponSlot WeaponSlotType, class UKSJobItem* JobItem, TArray<TSoftObjectPtr<class UKSItem>>* OwnedItems, TArray<class UPUMG_StoreItem*>* StoreItems);
	bool GetWeaponItem(EWeaponSlot WeaponSlotType, class UKSJobItem* JobItem, class UKSWeaponAsset** Weapon);
	void GetSkinItemsForJobItem(class UKSJobItem* JobItem, TArray<TSoftObjectPtr<class UKSItem>>* OwnedItems, TArray<class UPUMG_StoreItem*>* StoreItems);
	class UKSScrollBox* GetScrollBoxForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	struct FRogueCustomizationRelatedInfo GetRogueCustomizationRelatedInfoForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	void GetRadialMenuItems(TSoftObjectPtr<class UKSJobItem> ForJobItem, const struct FName& Tag, TArray<TSoftObjectPtr<class UKSItem>>* OwnedItems, TArray<class UPUMG_StoreItem*>* StoreItems);
	class UKSNavTabWidget* GetNavTabForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	class UKSStoreItemHelper* GetItemHelper();
	class UKSSortableGridPanel* GetItemContainerForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	void GetCosmeticItemsForSlot(EMercCosmeticSlot SlotType, EWeaponSlot WeaponSlotType, class UKSJobItem* JobItem, TArray<TSoftObjectPtr<class UKSItem>>* OwnedItems, TArray<class UPUMG_StoreItem*>* StoreItems);
	TArray<class UKSCosmeticItemSelectorWidget*> GetCosmeticItemSelectorsForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	class UKSSortableGridPanel* GetActiveSortableGridPanel();
	class UKSScrollBox* GetActiveScrollBox();
	struct FRogueCustomizationRelatedInfo GetActiveRogueCustomizationRelatedInfo();
	class UKSNavTabWidget* GetActiveNavTab();
	EMercCosmeticSlot GetActiveCosmeticSlot();
	TArray<class UKSCosmeticItemSelectorWidget*> GetActiveCosmeticItemSelectors();
	void ForceSetTabIndex(int NewTabIndex);
	void ClearCosmeticItemsForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot);
	void ChangeToNewTab();
	bool CanChangeTab();
	void AddRogueCustomizationRelatedInfo(int NewSwitcherIndex, EMercCosmeticSlot NewCosmeticSlot, class UKSNavTabWidget* NewNavTab, class UKSScrollBox* NewScrollBox, class UKSSortableGridPanel* NewSortableGridPanel);
	void AddCosmeticItemsForCosmeticSlot(EMercCosmeticSlot CheckCosmeticSlot, TArray<class UKSCosmeticItemSelectorWidget*> NewCosmeticItems);
};


// Class KillstreakUINew.KSDailyChallengeViewBase
// 0x0010 (0x04F0 - 0x04E0)
class UKSDailyChallengeViewBase : public UKSWidget
{
public:
	float                                              ChallengeTimerRefreshRate;                                // 0x04E0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0xC];                                       // 0x04E4(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSDailyChallengeViewBase");
		return ptr;
	}


	void UpdateChallenges();
	void InitializeChallengeDisplays();
	void HandlePlayerChallengesReady();
	void HandlePlayerChallengesChanged();
	void HandleDailyChallengeTimerRefreshed();
	TArray<class UKSActivityInstance*> GetDisplayingChallenges();
	void DisplayChallengeTimeRemaining(int TimeRemainingSeconds);
	void DisplayChallenge(int Index, class UKSActivityInstance* ActivityInstance, bool PlayFlourish);
};


// Class KillstreakUINew.KSDataSocialCategory
// 0x00B8 (0x00E0 - 0x0028)
class UKSDataSocialCategory : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnPlayersUpdated;                                         // 0x0028(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnHeaderUpdated;                                          // 0x0038(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnMessageUpdated;                                         // 0x0048(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x78];                                      // 0x0058(0x0078) MISSED OFFSET
	TArray<class UKSDataSocialPlayer*>                 SortedPlayerList;                                         // 0x00D0(0x0010) (CPF_ZeroConstructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class KillstreakUINew.KSDataSocialCategory");
		return ptr;
	}


	bool TryConsumeOpenOnUpdate();
	void SetOpenOnUpdate(bool Value);
	void SetMessageText(bool bProcessing, const struct FText& MessageText);
	void SetHeaderText(const struct FText& Header);
	int Num();
	bool IsProcessing();
	TArray<class UKSDataSocialPlayer*> GetPlayerList();
	struct FText GetMessageText();
	struct FText GetHeaderText();
	unsigned char BP_GetSectionValue();
};


// Class KillstreakUINew.KSDataSocialPlayer
// 0x0018 (0x0040 - 0x0028)
class UKSDataSocialPlayer : public UObject
{
public:
